[
  {
    "role": "Research Assistant",
    "institution": "Shiv Nadar Institute of Eminence (Deemed to be University), Delhi–NCR, India",
    "period": "July 2024 – Present",
    "supervisor": "Prof. Colin Jamora",
    "points": [
      "Investigating epigenetic and mechanical regulation of the cutaneous wound response, with a focus on wound-induced regulation of DNMT3a.",
      "Working extensively with primary mouse keratinocytes to study mechanotransduction-driven nuclear localization and function of epigenetic regulators."
    ]
  },
  {
    "role": "Research Scholar",
    "institution": "BRIC–Institute for Stem Cell Science and Regenerative Medicine (inStem), Bengaluru, India",
    "period": "August 2019 – Present",
    "supervisor": "Prof. Colin Jamora",
    "points": [
      "Investigated how wound-induced mechanical cues regulate the subcellular localization and activity of the de novo DNA methyltransferase DNMT3A during epidermal repair. Employed primary keratinocytes and established cell lines, integrating molecular biology, biochemistry, fluorescence microscopy, and genetic engineering approaches (bioRxiv: Ajnabi et al., 2026).",
      "Profiled immune cell states in patient skin before and after narrowband UV-B (NB-UVB) treatment using spatial transcriptomic approaches to resolve transcriptional heterogeneity within tissue. Complemented sequencing analyses with immunofluorescence and qPCR validation. (In Press: Dutta et al., 2026).",
      "Studied a Mindin-integrin-STAT3 signaling axis that sustains keratinocyte stemness through integrin endocytosis and downstream transcriptional activation (bioRxiv: Dam et al., 2025).",
      "Investigated the role of the extracellular matrix protein Mindin in skin fibrotic conditions (Journal of Investigative Dermatology: Rana et al., 2023).",
      "Studied antimicrobial peptide–mediated antiviral responses to SARS-CoV-2 (Frontiers in Immunology: Bhatt et al., 2023).",
      "Explored maintenance of epithelial stem/progenitor states via autocrine matricellular signaling (Cell Reports: Badarinath et al., 2022)."
    ]
  },
  {
    "role": "AIEEA-PG Scholar (Master’s Research)",
    "institution": "ICAR–National Institute for Plant Biotechnology, New Delhi, India",
    "period": "January 2018 – July 2019",
    "supervisor": "Dr. Monika Dalal",
    "points": [
      "Master’s research focused on identifying cis-regulatory regions controlling PM19 gene expression in wheat.",
      "Experience in in-silico genome analysis, gene/promoter cloning, transient GUS assays, plant tissue culture, and plant transformation."
    ]
  }
]
